Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/svd/PIC32CK2051SG00144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HMATRIX</name>
         <version>bus_hmatrix2_v55f0</version>
         <description>HSB Matrix</description>
         <groupName>HMATRIX2</groupName>
         <prependToName>HMATRIX2_</prependToName>
         <baseAddress>0x44806000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1B8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HMATRIX</name>
            <value>38</value>
         </interrupt>
         <registers>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>MCFG[%s]</name>
               <description>Master Configuration</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>ULBT</name>
                     <description>Undefined Length Burst Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>ULBTSelect</name>
                        <enumeratedValue>
                           <name>INFINITE</name>
                           <description>Infinite Length</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single Access</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_BEAT</name>
                           <description>Four Beat Burst</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EIGHT_BEAT</name>
                           <description>Eight Beat Burst</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIXTEEN_BEAT</name>
                           <description>Sixteen Beat Burst</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>13</dim>
               <dimIncrement>4</dimIncrement>
               <name>SCFG[%s]</name>
               <description>Slave Configuration</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>SLOT_CYCLE</name>
                     <description>Maximum Number of Allowed Cycles for a Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>DEFMSTR_TYPE</name>
                     <description>Default Master Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEFMSTR_TYPESelect</name>
                        <enumeratedValue>
                           <name>NO_DEFAULT</name>
                           <description>No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST_DEFAULT</name>
                           <description>Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIXED_DEFAULT</name>
                           <description>Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave.</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXED_DEFMSTR</name>
                     <description>Fixed Index of Default Master</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>13</dim>
               <dimIncrement>0x8</dimIncrement>
               <name>PRS[%s]</name>
               <description/>
               <addressOffset>0x080</addressOffset>
               <register>
                  <name>PRAS</name>
                  <description>Priority A for Slave</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>M0PR</name>
                        <description>Master 0 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN0</name>
                        <description>Latency Quality Of Service Enable for Master 0</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M1PR</name>
                        <description>Master 1 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN1</name>
                        <description>Latency Quality Of Service Enable for Master 1</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M2PR</name>
                        <description>Master 2 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN2</name>
                        <description>Latency Quality Of Service Enable for Master 2</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M3PR</name>
                        <description>Master 3 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN3</name>
                        <description>Latency Quality Of Service Enable for Master 3</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M4PR</name>
                        <description>Master 4 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN4</name>
                        <description>Latency Quality Of Service Enable for Master 4</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M5PR</name>
                        <description>Master 5 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN5</name>
                        <description>Latency Quality Of Service Enable for Master 5</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M6PR</name>
                        <description>Master 6 Priority</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN6</name>
                        <description>Latency Quality Of Service Enable for Master 6</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M7PR</name>
                        <description>Master 7 Priority</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN7</name>
                        <description>Latency Quality Of Service Enable for Master 7</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PRBS</name>
                  <description>Priority B for Slave</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>M8PR</name>
                        <description>Master 8 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN8</name>
                        <description>Latency Quality Of Service Enable for Master 8</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M9PR</name>
                        <description>Master 9 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN9</name>
                        <description>Latency Quality Of Service Enable for Master 9</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M10PR</name>
                        <description>Master 10 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN10</name>
                        <description>Latency Quality Of Service Enable for Master 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M11PR</name>
                        <description>Master 11 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN11</name>
                        <description>Latency Quality Of Service Enable for Master 11</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M12PR</name>
                        <description>Master 12 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN12</name>
                        <description>Latency Quality Of Service Enable for Master 12</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M13PR</name>
                        <description>Master 13 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN13</name>
                        <description>Latency Quality Of Service Enable for Master 13</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M14PR</name>
                        <description>Master 14 Priority</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN14</name>
                        <description>Latency Quality Of Service Enable for Master 14</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M15PR</name>
                        <description>Master 15 Priority</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN15</name>
                        <description>Latency Quality Of Service Enable for Master 15</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
